aaron-bond.better-comments
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
charliermarsh.ruff
danielpinto8zz6.c-cpp-compile-run
donjayamanne.githistory
ecmel.vscode-html-css
enkia.tokyo-night
exiasr.hadolint
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-pull-request-github
golang.go
grapecity.gc-excelviewer
hashicorp.terraform
hbenl.vscode-test-explorer
henriiik.docker-linter
ibm.output-colorizer
ionutvmi.path-autocomplete
johnpapa.vscode-peacock
kokakiwi.vscode-just
matangover.mypy
mechatroner.rainbow-csv
mhutchie.git-graph
mrmlnc.vscode-json5
mrpbennett.atlantic-night
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.tensorboard
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.test-adapter-converter
naumovs.color-highlight
njpwerner.autodocstring
oderwat.indent-rainbow
pnp.polacode
redhat.vscode-yaml
richie5um2.vscode-sort-json
ritwickdey.liveserver
robertostermann.inline-parameters-extended
rust-lang.rust-analyzer
sdras.night-owl
skellock.just
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
usernamehw.errorlens
vadimcn.vscode-lldb
viphakorn.mix-night-blue
vscode-icons-team.vscode-icons
innoverio.vscode-dbt-power-user
ryu1kn.partial-diff
saoudrizwan.claude-dev
dsznajder.es7-react-js-snippets
burkeholland.simple-react-snippets
xabikos.JavaScriptSnippets
christian-kohler.npm-intellisense
stylelint.vscode-stylelint
biomejs.biome
YoavBls.pretty-ts-errors