tap "rcmdnk/file"
brew "glib"
brew "cairo"
brew "coreutils"
brew "gcc"
brew "fd"
brew "gdrive"
brew "genact"
brew "git"
brew "hdf5"
brew "helix"
brew "libdap"
brew "libpq"
brew "little-cms2"
brew "netcdf"
brew "openblas"
brew "webp"
brew "qt@5"
brew "poppler-qt5"
brew "virtualenv"
brew "shellcheck"
brew "tealdeer"
brew "tree"
brew "font-fira-code"
brew "rcmdnk/file/brew-file"
brew "orbstack"

cask "1password"
cask "google-cloud-sdk"
cask "visual-studio-code"
cask "ghostty"
cask "raycast"
