tap "hashicorp/tap"
tap "homebrew/bundle"
tap "rcmdnk/file"
tap "homebrew/cask-fonts"
brew "act"
brew "bat"
brew "bottom"
brew "glib"
brew "cairo"
brew "coreutils"
brew "dust"
brew "eza"
brew "fd"
brew "gcc"
brew "gdrive"
brew "genact"
brew "gh"
brew "git"
brew "git-delta"
brew "hadolint"
brew "hdf5"
brew "helix"
brew "just"
brew "libdap"
brew "libpq"
brew "little-cms2"
brew "netcdf"
brew "node"
brew "openblas"
brew "webp"
brew "qt@5"
brew "poppler-qt5"
brew "virtualenv"
brew "pre-commit"
brew "python@3.11"
brew "ripgrep"
brew "sheldon"
brew "shellcheck"
brew "starship"
brew "tealdeer"
brew "tfsec"
brew "tree"
brew "hashicorp/tap/packer"
brew "rcmdnk/file/brew-file"
cask "1password"
cask "1password-cli"
cask "codewhisperer"
cask "docker"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "visual-studio-code"