tap "homebrew/bundle"
tap "hashicorp/tap"
tap "rcmdnk/file"

brew "actionlint"
brew "bat"
brew "bottom"
brew "glib"
brew "cairo"
brew "coreutils"
brew "dust"
brew "eza"
brew "fd"
brew "gcc"
brew "gdrive"
brew "gh"
brew "git"
brew "go"
brew "google-chrome"
brew "hdf5"
brew "helix"
brew "libdap"
brew "libpq"
brew "little-cms2"
brew "netcdf"
brew "notion"
brew "openblas"
brew "openssl@3"
brew "webp"
brew "qt@5"
brew "poppler-qt5"
brew "virtualenv"
brew "pre-commit"
brew "procs"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "sheldon"
brew "slack"
brew "starship"
brew "tealdeer"
brew "tfenv"
brew "tfsec"
brew "tmux"
brew "tree"
brew "xh"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"
brew "rcmdnk/file/brew-file"

cask "font-hack-nerd-font"
cask "visual-studio-code"
cask "google-cloud-sdk"
cask "docker"

vscode "aaron-bond.better-comments"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bierner.markdown-preview-github-styles"
vscode "charliermarsh.ruff"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "frenco.vscode-notion"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "henriiik.docker-linter"
vscode "IBM.output-colorizer"
vscode "ionutvmi.path-autocomplete"
vscode "johnpapa.vscode-peacock"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "matangover.mypy"
vscode "mhutchie.git-graph"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pnp.polacode"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "shalldie.background"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
